#+TITLE: PRACTICE - SCANF
#+AUTHOR: Marcus Birkenkrahe (pledged)
#+PROPERTY: header-args:C :main yes :includes <stdio.h> :results output :exports both
#+STARTUP: hideblocks overview indent
* Scan integer and floating-point input

*Problem*: Write a C program =scan1.c= that accepts two integer and two
floating-point values from the keyboard and prints them.

*Sample Input:*
#+begin_example
100 -1000 .456 -9.34e2
#+end_example

*Sample Output:*
#+begin_example
|  100|-1000|0.456| -934|
#+end_example

*Solution:*

1) Open a terminal.

2) Create a new file =scan1.c=.

3) Write the source code for a C program with input and output. Save
   at any point with =CTRL + s=.

4) Define two /integer/ variables ~k~, ~l~, and two /floating-point/ variables
   ~u~ and ~v~

5) Ask the user for input.

6) Complete the ~scanf~ /format string/ and enter the variables list to
   scan these variables

7) Save your file and compile it with =gcc= to check for syntax
   correctness. The standard executable is called =a.out=.

8) Run the executable using the relative path =./a.out= and enter the
   input by hand: ~100 -1000 .456 -9.34e2~

9) Alternatively, you can put the input into a file and redirect it to
   the executable. First create the input file:
   #+begin_src bash
     echo "100 -1000 .456 -9.34e2" > input1
     cat input1
   #+end_src

   #+RESULTS:
   : 100 -1000 .456 -9.34e2

10) Next, run the file using the =input1= file:
    #+begin_example sh
    ./a.out < input1
    #+end_example

11) Fix the =scanf= format until you get the desired output[fn:3]:
    #+name: pgm:scanf_out
    #+begin_example
     |  100|-1000|0.456| -934|
    #+end_example

12) Compile your file with =gcc= once more, and name the executable
    (object file) =scan1= with the command:
    #+begin_example sh
    gcc scan1.c -o scan1
    #+end_example

13) Run the file using the relative path to the file and the input
    data:
    #+begin_example
    ./scan1 < input1
    #+end_example

14) If everything works, download the file to your PC (~Open editor~,
    find the file in the sidebar, right-click to ~Download~).

15) Revisit all that you learnt before tackling the next one!
    #+begin_quote

|    | Concept/Action                       | Command/Code Example               |
|----+--------------------------------------+------------------------------------|
|  1 | Open a terminal                      | ~Open terminal~                      |
|  2 | Create a new file                    | =nano scan.c=                        |
|  3 | Compile with =gcc=                     | =gcc scan.c=                         |
|  4 | Relative file path                   | =ls ..=                              |
|  5 | Run executable with manual input     | =./a.out= <CR> 100                   |
|  6 | Create input file & view contents    | =echo "100" > input <CR> cat input=  |
|  7 | Run executable with redirected input | =./a.out < input=                    |
|  8 | Compile with specific output name    | =gcc scan.c -o scan=                 |
|  9 | Run named executable with input file | =./scanf < input=                    |
| 10 | Download the file to PC              | ~Open editor~ - ~Download~             |

    #+end_quote

Bonus commands: =history= (of commands), =ll= (long listing), =ls -lt= (long
listing, time-ordered), =clear= (clean up), =*= (globbing).

* Add fractions

*Problem*: Write a C program =scan4.c= that prompts the user to add two
fractions and then displays the fractions and their sum.

*Sample Input:*
#+begin_example
5/6•
3/4
#+end_example

*Sample Output:*
#+begin_example
5/6 + 3/4 = 38/24
#+end_example

*Solution:*

1) Use the following command on the command-line shell to copy a
   template program from GitHub that you can then fill in:
   #+begin_src bash :results output :exports both
     wget -O scan4.c tinyurl.com/scan4-c
   #+end_src

2) Put the following *sample input* in an input file:
   #+begin_example
   5/6•
   3/4
   #+end_example

3) To do this, run this code on the command-line:
   #+begin_src bash :results output
     echo "5/6 " > input4
     echo "3/4"  >> input4
     cat input
   #+end_src

   #+RESULTS:
   : 5/6
   : 3/4

4) The *sample output* for the input 5/6 and 3/4 is:
   #+begin_example
   5/6 + 3/4 = 38/24
   #+end_example

5) The program prompts the user to add two fractions and then display
   their sum. Complete the format strings below so that the program
   runs as intended!
   #+name: pgm:addFrac
   #+begin_src C :cmdline < addFrac_input :results output :tangle ../src/scan4.c
     // declare variables
     int num1, denom1, num2, denom2, result_num, result_denom;

     // scan input
     scanf("...", &num1, &denom1);
     scanf("...", &num2, &denom2);

     // compute numerator and denominator
     result_num = num1 * denom2 + num2 *denom1;
     result_denom = denom1 * denom2;

     // print result
     printf("%d/%d + %d/%d = %d/%d\n",
            num1, denom1, num2, denom2,
            result_num, result_denom);
   #+end_src

6) Compile the program into an object file =scan4= and run it with =input4=:
   #+begin_example sh
   gcc scan4.c -o scan4
   ./scan4 < input4
   #+end_example

7) When you got the right results, copy =scan4.c= into =scan5.c= using =cp
   -v=. Open the file with =nano=, update the filename at the top, and
   modify the program so that there is only *on* ~scanf~ statement. Make
   sure that the modified program yields the same result as before.

